#!/bin/bash

##################################################################
# Формат сообщения командного топика
##################################################################
#int16     id       # Controller or robot id
#int16     command  # Command
#float32[] arg      # Arguments
#int16[]   angle    # Servo angles

##################################################################
# Команды
##################################################################
# Y13_CMD_BEEP_ON  1
# Y13_CMD_BEEP_OFF 2

# Y13_CMD_GUN_ON   3
# Y13_CMD_GUN_OFF  4

# Установка углов сервомашинок: arg[0]-arg[2]
# Y13_CMD_SET_ANG  5

# Установка дистанций срабатывания рефлексов, см.
# Аргументы: arg[0] - центр., arg[1] - левый, arg[2] - правый
# Y13_CMD_SET_REFL_DIST_LEFT 6

# Установка энкодеров. Аргументы: arg[0], arg[1]
# Y13_CMD_SET_ENC      7

# Установка параметров ПИД-регулятора: arg[0], arg[1], arg[2]: p, i, d соответственно
# Y13_CMD_SET_PID      8

# Запуск процедуры калибровки компаса
# Y13_CMD_COMPASS_CALIBR     9

# Скорость поворота при калибровке и количество шагов args[0], args[1]
# Y13_CMD_SET_CALIBR_SPEED   10

# Установка масштабных множителей для согласования характеристик двигателей.
# Значения лежат в msg.arg[0] (левый двигатель) и msg.arg[1] (правый двигатель)
# Y13_CMD_SET_MOTORS_RATIO   11

# Установка параметров ПИД-регулятора левого двигателя.
# Аргументы: arg[0]- arg[2]: p, i, d соответственно
# Y13_CMD_SET_PID_LEFT  12

# Установка параметров ПИД-регулятора правого двигателя.
# Аргументы: arg[0]- arg[2]: p, i, d соответственно
# Y13_CMD_SET_PID_RIGHT  13

###############################################################

#rostopic pub -1 /yy_command msg_yy/cmd 1 1 [] [] '[0,0,0,0]'
#sleep 1
#rostopic pub -1 /yy_command msg_yy/cmd 1 2 [] [] '[0,0,0,0]'

#
# Установка параметров обоих ПИД-регуляторов: arg[0], arg[1], arg[2]: p, i, d соответственно
# Kp0(0.5),Ki0(0.01),Kd0(0.2)
#
#rostopic pub -1 /yy_command msg_yy/cmd 1 8 '[0.5, 0.01, 0.2]' [] '[0,0,0,0]'

#
# Калибровка
#
# Скорость вращения и число шагов (40, 600)
#rostopic pub -1 /yy_command msg_yy/cmd 1 10 '[60, 600]' [] '[0,0,0,0]'

# Запуск процедуры калибровки компаса
#rostopic pub -1 /yy_command msg_yy/cmd 1  9 [] [] '[0,0,0,0]'


#
# Установка параметров левого ПИД-регулятора: arg[0], arg[1], arg[2]: p, i, d соответственно
# Kp0(0.5),Ki0(0.01),Kd0(0.2)
#
rostopic pub -1 /yy_command msg_yy/cmd 1 12 '[0.5, 0.075, 0.2]' [] '[0,0,0,0]'

#
# Установка параметров правого ПИД-регулятора: arg[0], arg[1], arg[2]: p, i, d соответственно
# Kp0(0.5),Ki0(0.01),Kd0(0.2)
#
rostopic pub -1 /yy_command msg_yy/cmd 1 13 '[0.5, 0.095, 0.2]' [] '[0,0,0,0]'

# Установка масштабных множителей для согласования характеристик двигателей
#rostopic pub -1 /yy_command msg_yy/cmd 1 11 '[1.0, 1.25]' [] '[0,0,0,0]'
